Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4CMP16C_0.xml
        <register caption="Receive Pointer Register" name="AES_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="AES_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="AES_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="AES_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="AES_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="AES_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="AES_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="AES_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="AES_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="AES_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="AES_MR__DUALBUFF">
        <value caption="AES_IDATARx cannot be written during processing of previous block." name="INACTIVE" value="0x0"/>
        <value caption="AES_IDATARx can be written during processing of previous block when SMOD = 0x2. It speeds up the overall runtime of large files." name="ACTIVE" value="0x1"/>
      </value-group>
      <value-group caption="" name="AES_MR__SMOD">
        <value caption="Manual Mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto Mode" name="AUTO_START" value="0x1"/>
        <value caption="AES_IDATAR0 access only Auto Mode" name="IDATAR0_START" value="0x2"/>
      </value-group>
      <value-group caption="" name="AES_MR__KEYSIZE">
        <value caption="AES Key Size is 128 bits" name="AES128" value="0x0"/>
        <value caption="AES Key Size is 192 bits" name="AES192" value="0x1"/>
        <value caption="AES Key Size is 256 bits" name="AES256" value="0x2"/>
      </value-group>
      <value-group caption="" name="AES_MR__OPMOD">
        <value caption="ECB: Electronic Code Book mode" name="ECB" value="0x0"/>
        <value caption="CBC: Cipher Block Chaining mode" name="CBC" value="0x1"/>
        <value caption="OFB: Output Feedback mode" name="OFB" value="0x2"/>
        <value caption="CFB: Cipher Feedback mode" name="CFB" value="0x3"/>
        <value caption="CTR: Counter mode (16-bit internal counter)" name="CTR" value="0x4"/>
        <value caption="GCM: Galois Counter mode" name="GCM" value="0x5"/>
      </value-group>
      <value-group caption="" name="AES_MR__CFBS">
        <value caption="128-bit" name="SIZE_128BIT" value="0x0"/>
        <value caption="64-bit" name="SIZE_64BIT" value="0x1"/>
        <value caption="32-bit" name="SIZE_32BIT" value="0x2"/>
        <value caption="16-bit" name="SIZE_16BIT" value="0x3"/>
        <value caption="8-bit" name="SIZE_8BIT" value="0x4"/>
      </value-group>
      <value-group caption="" name="AES_MR__CKEY">
        <value caption="This field must be written with 0xE the first time that AES_MR is programmed. For subsequent programming of the AES_MR, any value can be written, including that of 0xE.Always reads as 0." name="PASSWD" value="0xE"/>
      </value-group>
      <value-group caption="" name="AES_ISR__URAT">
        <value caption="Input Data Register written during the data processing when SMOD = 0x2 mode." name="IDR_WR_PROCESSING" value="0x0"/>
        <value caption="Output Data Register read during the data processing." name="ODR_RD_PROCESSING" value="0x1"/>
        <value caption="Mode Register written during the data processing." name="MR_WR_PROCESSING" value="0x2"/>
        <value caption="Output Data Register read during the sub-keys generation." name="ODR_RD_SUBKGEN" value="0x3"/>
        <value caption="Mode Register written during the sub-keys generation." name="MR_WR_SUBKGEN" value="0x4"/>
        <value caption="Write-only register read access." name="WOR_RD_ACCESS" value="0x5"/>
      </value-group>
    </module>
    <module caption="Chip Identifier" name="CHIPID" version="6417R">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID" values="CHIPID_EXID__EXID"/>
        </register>
      </register-group>
      <value-group caption="" name="CHIPID_CIDR__EPROC">
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
